```hcl
07:21:48.696 INFO   The runner at . will be processed in the following order for command plan:
Group 1
- Unit ./iam-policy

Group 2
- Unit ./iam-user


module.iam_policy["psp-1-backup-s3"].aws_iam_policy.policy[0]: Refreshing state... [id=arn:aws:iam::587210147621:policy/psp-1-backup-s3]
module.iam_policy["ecr_user"].aws_iam_policy.policy[0]: Refreshing state... [id=arn:aws:iam::587210147621:policy/ecr_user]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.iam_user["ecr_user"].aws_iam_access_key.this_no_pgp[0] will be created
  + resource "aws_iam_access_key" "this_no_pgp" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "ecr_user"
    }

  # module.iam_user["ecr_user"].aws_iam_user.this[0] will be created
  + resource "aws_iam_user" "this" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "ecr_user"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

  # module.iam_user["ecr_user"].aws_iam_user_policy_attachment.this["0"] will be created
  + resource "aws_iam_user_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::587210147621:policy/ecr_user"
      + user       = "ecr_user"
    }

  # module.iam_user["psp-1-backup-s3"].aws_iam_access_key.this_no_pgp[0] will be created
  + resource "aws_iam_access_key" "this_no_pgp" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "psp-1-backup-s3"
    }

  # module.iam_user["psp-1-backup-s3"].aws_iam_user.this[0] will be created
  + resource "aws_iam_user" "this" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "psp-1-backup-s3"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

  # module.iam_user["psp-1-backup-s3"].aws_iam_user_policy_attachment.this["0"] will be created
  + resource "aws_iam_user_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::587210147621:policy/psp-1-backup-s3"
      + user       = "psp-1-backup-s3"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + access_keys = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf-plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf-plan"
```

<!-- thollander/actions-comment-pull-request "file" -->